function returnStar(value) {
    var starStr = "";
    for(var i=1; i<= value; i++) {
        starStr +=  "<i class='fa fa-star star'></i>";
    }
    for(;i<=5;i++){
        starStr +=  "<i class='fa fa-star-o star'></i>";
    }

    return starStr;
}

$(function() {
    "use strict";

    // 收入统计
    var $roomTable = $("#room-table");

    $roomTable.dataTable({
        "info" : false,
        "paging": true,
        "filter": false,
        "lengthChange": false,
        "pageLength":8,
        "destroy": true,
        "columns": [
            { "title": "#", "class": "center" },
            { "title": "机房名称", "class": "center" },
            { "title": "城市", "class": "center" },
            { "title": "机柜（万/月）", "class": "center" },
            { "title": "带宽（万/月）", "class": "center" },
            { "title": "增值业务（万/月）", "class": "center" },
            { "title": "免费客户支出", "class": "center" },
            { "title": "收入总计（万/月）", "class": "center" }
        ],
        "data": [
            ["1" , "金石" , "石家庄", "12.1", "31.3","6.3","1.3","48.4"],
            ["2" , "鹿泉" , "石家庄", "23.4", "95.2","36.1","8.3","146.4"],
            ["3" , "二枢纽" , "石家庄", "16.2", "15.7","3.5","3.2","32.2"],
            ["4" , "A机房", "保定", "6.8", "11.9","12.5","1.2","30"],
            ["5" , "B机房", "保定", "3.2", "8.4","0.5","0.2","11.9"],
            ["6" , "C机房", "保定", "4.3", "5.9","1.6","1.0","10.8"],
            ["7" , "A机房", "唐山", "12.1", "31.3","6.3","1.3","48.4"],
            ["8" , "B机房", "唐山", "21.1", "41.3","15.8","11.3","66.9"],
            ["9" , "C机房", "唐山", "12.1", "31.3","6.3","1.3","48.4"],
            ["10", "A机房", "邯郸", "12.1", "31.3","6.3","1.3","48.4"],
            ["11", "B机房", "邯郸", "12.1", "31.3","6.3","1.3","48.4"],
            ["12", "C机房", "邯郸", "12.1", "31.3","6.3","1.3","48.4"],
            ["13", "A机房", "张家口", "12.1", "31.3","6.3","1.3","48.4"],
            ["15", "B机房", "张家口", "12.1", "31.3","6.3","1.3","48.4"],
            ["16", "C机房", "张家口", "12.1", "31.3","6.3","1.3","48.4"],
            ["17", "A机房", "承德", "12.1", "31.3","6.3","1.3","48.4"],
            ["18", "B机房", "承德", "12.1", "31.3","6.3","1.3","48.4"],
            ["19", "C机房", "承德", "12.1", "31.3","6.3","1.3","48.4"],
            ["20", "D机房", "承德", "12.1", "31.3","6.3","1.3","48.4"],
            ["21", "A机房", "沧州", "12.1", "31.3","6.3","1.3","48.4"],
            ["22", "B机房", "沧州", "12.1", "31.3","6.3","1.3","48.4"],
            ["23", "C机房", "沧州", "12.1", "31.3","6.3","1.3","48.4"],
            ["24", "D机房", "沧州", "12.1", "31.3","6.3","1.3","48.4"],
            ["25", "E机房", "沧州", "12.1", "31.3","6.3","1.3","48.4"]
        ]
    });

    var $incomeChart = $("#container");

    $incomeChart.highcharts({
        chart: {
            type: 'bar'
        },
        title: {
            text: 'Stacked bar chart'
        },

        xAxis: {
            categories: ['Apples', 'Oranges', 'Pears', 'Grapes', 'Bananas']
        },

        yAxis: {
            min: 0,
            title: {
                text: 'Total fruit consumption'
            }
        },

        legend: {
            reversed: true
        },

        plotOptions: {
            series: {
                stacking: 'normal'
            }
        },

        series: [{
            name: 'John',
            data: [5, 3, 4, 7, 2]
        }, {
            name: 'Jane',
            data: [2, 2, 3, 2, 1]
        }, {
            name: 'Joe',
            data: [3, 4, 4, 2, 5]
        }]
    });

//    $incomeChart.highcharts({
//        chart: {
//            plotBackgroundColor: null,
//            plotBorderWidth: null,
//            plotShadow: false
//        },
//        title: {
//            text: '全省机柜总量分布'
//        },
//        tooltip: {
//            pointFormat: '{series.name}: <b>{point.percentage:.1f}%</b>'
//        },
//        plotOptions: {
//            pie: {
//                allowPointSelect: true,
//                cursor: 'pointer',
//                dataLabels: {
//                    enabled: false
//                },
//                showInLegend: true
//            }
//        },
//        series: [{
//            type: 'pie',
//            name: '机柜占有率',
//            data: [
//                ['鹿泉', 1265],
//                ['二枢纽', 762],
//                {
//                    name: '金石',
//                    y: 410,
//                    sliced: true,
//                    selected: true
//                },
//                ['保定', 1563],
//                ['唐山', 1245],
//                ['其他', 2726]
//            ]
//        }]
//    });



//    // 运营分析
//    var $roomOpTable = $("#room-op-table");
//
//    $roomOpTable.dataTable({
//        "info" : false,
//        "paging": true,
//        "filter": false,
//        "lengthChange": false,
//        "pageLength":8,
//        "destroy": true,
//        "columns": [
//            { "title": "#", "class": "center" },
//            { "title": "机房名称", "class": "center" },
//            { "title": "城市", "class": "center" },
//            { "title": "机柜利用率（%）", "class": "center" },
//            { "title": "带宽利用率（%）", "class": "center" },
//            { "title": "增值业务利用率（%）", "class": "center" },
//            { "title": "投资收益率（%）", "class": "center" }
//        ],
//        "data": [
//            ["1" , "金石" , "石家庄", "42.1", "31.3","56.3","168.6"],
//            ["2" , "鹿泉" , "石家庄", "63.4", "75.2","36.1","135.3"],
//            ["3" , "二枢纽" , "石家庄", "36.2", "35.7","1.5","128.5"],
//            ["4" , "A机房", "保定", "26.8", "31.9","32.5","149.6"],
//            ["5" , "B机房", "保定", "33.2", "48.4","3.5","97.3"],
//            ["6" , "C机房", "保定", "34.3", "36.9","31.6","76.7"],
//            ["7" , "A机房", "唐山", "32.1", "31.3","53.3","108.5"],
//            ["8" , "B机房", "唐山", "21.1", "41.3","35.8","154.9"],
//            ["9" , "C机房", "唐山", "12.1", "31.3","6.3","128.6"],
//            ["10", "A机房", "邯郸", "12.1", "31.3","6.3","128.6"],
//            ["11", "B机房", "邯郸", "12.1", "31.3","6.3","128.6"],
//            ["12", "C机房", "邯郸", "12.1", "31.3","6.3","128.6"],
//            ["13", "A机房", "张家口", "12.1", "31.3","6.3","128.6"],
//            ["15", "B机房", "张家口", "12.1", "31.3","6.3","128.6"],
//            ["16", "C机房", "张家口", "12.1", "31.3","6.3","128.6"],
//            ["17", "A机房", "承德", "12.1", "31.3","6.3","128.6"],
//            ["18", "B机房", "承德", "12.1", "31.3","6.3","128.6"],
//            ["19", "C机房", "承德", "12.1", "31.3","6.3","128.6"],
//            ["20", "D机房", "承德", "12.1", "31.3","6.3","128.6"],
//            ["21", "A机房", "沧州", "12.1", "31.3","6.3","128.6"],
//            ["22", "B机房", "沧州", "12.1", "31.3","6.3","128.6"],
//            ["23", "C机房", "沧州", "12.1", "31.3","6.3","128.6"],
//            ["24", "D机房", "沧州", "12.1", "31.3","6.3","128.6"],
//            ["25", "E机房", "沧州", "12.1", "31.3","6.3","128.6"]
//        ]
//    });
});